[
    {
      "id": "6249d51642b218c526d4cc5e",
      "rating": "4.5",
      "img": "https://i.ibb.co/KNgWhck/user-1.jpg",
      "name": "Randi Mcknight",
      "about": "I’ve been developing quite an interest in epic fantasies of late, and have been fortunate enough to read ones with a variety of flavors and themes. I have loved each one of them, but none has ever challenged, and eventually satisfied the very core of my values and faith—both as a reader and a writer—as this one has\r\n"
    },
    {
      "id": "6249d516a810501c10582b4a",
      "rating": "5",
      "img": "https://i.ibb.co/FxP17Yy/user-2.jpg",
      "name": "Cain Cochran",
      "about": "One of the things I shy away from when it comes to epic fantasies, aside from its length, is the number of characters I will have to keep up with. I’ve always felt like I would get confused and soon forget who is who and which is which. Curiously though, this was never a problem while reading Ian V. Conrey’s Hælend’s Ballad.\r\n"
    },
    {
      "id": "6249d516d8fe4e9cecb60aa5",
      "rating": "4",
      "img": "https://i.ibb.co/RhMYD5Z/user-3.jpg",
      "name": "Riggs Schneider",
      "about": "I have been searching for a good Christian fantasy to add to my library and mention as one of the best ones that influenced the stories I hope to be writing in the future. Hælend’s Ballad is an epic way to start that collection.\r\n"
    },
    {
      "id": "6249d5167f57ca7d37b9942c",
      "rating": "4.7",
      "img": "https://i.ibb.co/VSM4W1p/user-4.jpg",
      "name": "Esmeralda England",
      "about": "I'm a casual reader, always on the lookout for new books to read. I try to find the good in every story and will rave about what has touched me deeply. If something did not work for me, I can be very honest in saying so and explain 'why' to the very best of my ability. \r\n"
    },
    {
      "id": "6249d5169f19f1acbd57634e",
      "rating": "5",
      "img": "https://i.ibb.co/2MzXjhx/user-10.jpg",
      "name": "Penelope Wong",
      "about": " Hi Ian, it's comforting to see that I'm not the only author of a book with Sensitive Content—whatever that is. If you have a chance, take a look at Forbidden, published today. You might find the backstory of interest. Myth, history, and male abuse of women. Oh...and a tender love story.\r\n"
    },
    {
      "id": "6249d516b6fd6503c87bc7df",
      "rating": "3",
      "img": "https://i.ibb.co/hWSc35w/user-7.jpg",
      "name": "Karen Frost",
      "about": "it really good to see this and read, i really love what you said here it really sound good and perfect\r\n"
    },
    {
      "id": "6249d516bdd27d46c676d1b2",
      "rating": "4.5",
      "img": "https://i.ibb.co/QHg0PLz/user-13.jpg",
      "name": "Merritt Mendez",
      "about": "It is hard enough to create characters to populate a lengthy tale of such epic proportions (and disproportions), but it is harder still to make each one of them be their own person—a feat that, as far as I’m concerned, Mr. Conrey has achieved. It does take some commitment on the reader’s part to follow along and keep tabs of the characters—who they are, which side they’re on and what they stand for—but it is definitely a committed time well spent and ultimately well satisfied in the end. Not to mention that once you get started reading, the story has a tendency to just flow smoothly—like a movie—with each scene seasoned with just the right amount of descriptions and backstories, and always given much more life by realistic dialogues and peeks into the characters’ internal struggles, so familiar that they resonate with the personal thoughts and questions that we may not even be aware we have about our values, our faiths, and our very lives.\r\n"
    }
  ]